{
  "header": {
    "title": "Software Engineer - Front-End Developer",
    "menu": {
      "about": "About",
      "skills": "Skills",
      "creations": "Creations"
    }
  },
  "about": {
    "title": "About",
    "dev": "Front-end developer specialized in javascript frameworks such as Vue, React and Angular I'm interested in integration, ergonomics and accessibility, as well as communication. My goal is to build bridges between designers and developpers, by understanding challenges and constraints on both sides. UX development is an exciting field for its evolving technologies and paradigms. But it foremost forces empathy toward users, and allows to work with various profiles going from back-end developers to artists. This richness and its human aspect is what I enjoy the most.",
    "games": "I also develop games on my spare time. They are mostly experimental, narrative and contemplative, with sometimes a focus on generative music. It's a great way to experiment with technologies, notably the Web Audio API. They also encourage me to create non utilitarian projects, using technologies only for entertainment, art, and in the end making them more human. Games are the ideal media to combine my developpers skills with some of my hobbies, such as writing and composing.",
    "perso": "Outside of these activities, I enjoy theatre (as an amateur comedian), video editing, piano, walks and board games.",
    "useful": {
      "title": "Useful informations",
      "age": "Age:",
      "location": "Living location:",
      "employer": "Currrent employer:"
    }
  },
  "skills": {
    "title": "Skills & Experiences",
    "technologies": "Technologies",
    "languages": "Languages",
    "experiences": {
      "header": "Experiences",
      "lonestone": {
        "post": "Web developper",
        "description": "Front-end and back-end development of websites and online applications"
      },
      "mgdis": {
        "post": "Software developper",
        "description": "Web Front-End development for decision assisting tools used by public organisms"
      },
      "osytos2": {
        "post": "Internship",
        "description": "Conception of a tool facilitating the creation of web pages for dashboard and configuration panels"
      },
      "osytos1": {
        "post": "Internship",
        "description": "File synchronization between networks, with a web user interface"
      },
      "yvesrocher": {
        "post": "Internship",
        "description": "Regression testing of web-services"
      }
    },
    "formations": {
      "header": "Formations",
      "esir": {
        "type": "Master's Degree in Engineering",
        "formation": "ESIR, Software engineering"
      },
      "iut": {
        "type": "Associate's degree",
        "formation": "IUT, Software development"
      },
      "rgaa": {
        "type": "Professional formation on Web Accessibility",
        "formation": "Designing and developping websites compliant with RGAA 3"
      }
    }
  },
  "creations": {
    "title": "Creations",
    "games": {
      "title": "Games",
      "summary": "I've started game development in 2016. I'm making short games, mostly for the web. Some have been made during 48 hours jams. You cn find the entire list of them on <a href='{link}'>itch.io</a>."
    },
    "experiments": {
      "title": "Experiments",
      "summary": "These are personal creations made to test or learn various technologies."
    },
    "videos": {
      "title": "Videos (French)",
      "summary": "<p>In 2015, I started making videos on Youtube. For two years I experimented with the medium, by producing on a regular basis videos of various styles (sketches, analyses, essays…). It isn't until 2017 that I decided to focus on game-design.</p> <p>My goal is to create reflexions on how we define video-games, show new and creative ways to use them, and share thoughts on some alternative games.</p> <p>These videos can be seen on the channel <a href='{link}' target='_blank'>Excursions Virtuelles</a> (Virtual Wanders). As stated, they are in French. However, I do my best to have them subtitled. Although those subtitles are also in French, you can either use the auto-translate or contact me if you want me to add English subtitles for a particular video.</p>"
    },
    "tools": {
      "title": "Tools",
      "summary": "Libraries and utilitary softwares that I've developed."
    },
    "moog-memories": {
      "description": "Interactive music in HTML5, made for the Music Game Jam 2017"
    },
    "tabletop-dance": {
      "description": "Puzzle shooter made during the GMTK Jam 2017"
    },
    "safe-bots": {
      "description": "Puzzle game made in one week"
    },
    "deep-sea-school": {
      "description": "Exploration and narration game"
    },
    "landscape-sounds": {
      "description": "Generative music procedurally created by the Web Audio API"
    },
    "harmonit": {
      "description": "Application displaying chords, made in React Redux"
    },
    "once-upon-nothing": {
      "description": "Random sentences generator, in Angular 2"
    },
    "terrible-logos": {
      "description": "Weirdly styled text, using BEM methodology"
    },
    "blood-not-allowed": {
      "description": "A text-only comedy-horror musical"
    },
    "in-octave": {
      "description": "Shooter with procedural music"
    },
    "orchestre-js": {
      "description": "A web audio library to dynamically manage instrumental layers in a song."
    },
    "joy-phases": {
      "description": "A musical phasing sequencer"
    }
  },
  "today": "today"
}
